# ConnectorManager Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPModel..::..ConnectorManager Property
MEPModel Class See Also
---
Retrieves the Connector Manager from this MEPModel.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ConnectorManager ConnectorManager { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ConnectorManager As ConnectorManager
	Get
```

Visual C++
---
```text
public:
property ConnectorManager^ ConnectorManager {
	ConnectorManager^ get ();
}
```

# See Also
MEPModel Class
Autodesk.Revit.DB Namespace